gbm-ii/STM32_Inc/stm32yyyy.h
/*
	STM32 series common enhanced defs
	gbm 09'2014

	Should be included after stm32XXxx.h.
*/

#ifndef __STM32YYYY_H
#define __STM32YYYY_H

typedef __IO uint32_t * __IO32p;	// short type name
//========================================================================
// STM32xxxx register/bit defs not present in stm32xxxx.h file
#undef SCB_AIRCR_VECTKEY	// some F10x.h files contain key mask definition instead of key value
#define SCB_AIRCR_VECTKEY	0x05fa0000

// convert Vrefint ADC readout to power supply voltage value
#define GET_Vdd_mV(x)	(VREFINT_CAL * VREFINT_CAL_mV / (x))

#define CRS_CFGR_SYNCSRC_LSE	CRS_CFGR_SYNCSRC_0
#define CRS_CFGR_SYNCSRC_USB	CRS_CFGR_SYNCSRC_1
// GPIO ==================================================================
#define GPIO_SPACING	((uint8_t *)GPIOB - (uint8_t *)GPIOA)
#define GPIOBYIDX(idx) ((GPIO_TypeDef *)((uint8_t *)GPIOA +  GPIO_SPACING * (idx)))
#define GPIOIDX(p)	(((uint8_t *)(p) - (uint8_t *)GPIOA) / GPIO_SPACING)
#define RCC_IOENR_GPIOENBIT(idx) ( (RCC_IOENR_GPIOAEN) << (idx) )
#define RCC_IOENR_GPIOEN(p) ( RCC_IOENR_GPIOENBIT(GPIOIDX(p)) )

#define GPIO_MODER_IN	0u
#define GPIO_MODER_OUT	1u
#define GPIO_MODER_AF	2u
#define GPIO_MODER_AN	3u

#define GPIO_MODE_IN(p)	(0u << (p)*2)
#define GPIO_MODE_OUT(p)	(1u << (p)*2)
#define GPIO_MODE_AF(p)	(2u << (p)*2)
#define GPIO_MODE_AN(p)	(3u << (p)*2)

#define GPIO_PUPDR_PU	1u
#define GPIO_PUPDR_PD	2u

// GPIOA settings for 2-wire SWD
#define SWCLK_BIT	14
#define SWDIO_BIT	13
#define GPIOA_MODER_SWD	(BF2(SWCLK_BIT, GPIO_MODER_AF) | BF2(SWDIO_BIT, GPIO_MODER_AF)) // keep SWD pins only
#define GPIOA_MODER_SWDA	(BF2(SWCLK_BIT, GPIO_MODER_AF) | BF2(SWDIO_BIT, GPIO_MODER_AF) | 0xc3ffffffu) // keep SWD pins only
#define GPIOA_PUPDR_SWD	(BF2(SWCLK_BIT, GPIO_PUPDR_PD) | BF2(SWDIO_BIT, GPIO_PUPDR_PU)) // SWD CLK->PD, DIO->PU
#define GPIOA_OSPEEDR_SWD	(BF2(SWDIO_BIT, GPIO_OSPEEDR_HI))	// SWDIO

#define PWR_CR_PLSV(a)	(((a) & 7) << 5)

#define DMA_CCR_MSIZE16	DMA_CCR_MSIZE_0
#define DMA_CCR_MSIZE32	DMA_CCR_MSIZE_1
#define DMA_CCR_PSIZE16	DMA_CCR_PSIZE_0
#define DMA_CCR_PSIZE32	DMA_CCR_PSIZE_1
#define DMA_CCR_DIR_P2M	0
#define DMA_CCR_DIR_M2P	DMA_CCR_DIR

#define TIM_CCMR1_OC1MD(x)	(((x) & 8u) << 13 | (x & 7) << TIM_CCMR1_OC1M_Pos)
#define TIM_CCMR1_OC2MD(x)	(TIM_CCMR1_OC1MD(x) << 8)

#define TIM_CCMR1_OC1M_PWM1	TIM_CCMR1_OC1MD(6)	// OC1M[2:0] - PWM mode 1
#define TIM_CCMR1_OC2M_PWM1	TIM_CCMR1_OC2MD(6)	// OC1M[2:0] - PWM mode 1
#define TIM_CCMR2_OC3M_PWM1	TIM_CCMR1_OC1M_PWM1	// OC3M[2:0] - PWM mode 1
#define TIM_CCMR2_OC4M_PWM1	TIM_CCMR1_OC2M_PWM1	// OC4M[2:0] - PWM mode 1

#define TIM_CCMR1_OC1M_PWM2	TIM_CCMR1_OC1MD(7)	// OC1M[2:0] - PWM mode 1
#define TIM_CCMR1_OC2M_PWM2	TIM_CCMR1_OC2MD(7)	// OC1M[2:0] - PWM mode 1
#define TIM_CCMR2_OC3M_PWM2	TIM_CCMR1_OC1M_PWM2	// OC3M[2:0] - PWM mode 1
#define TIM_CCMR2_OC4M_PWM2	TIM_CCMR1_OC2M_PWM2	// OC4M[2:0] - PWM mode 1

#define TIM_CCMR1_OC1M_ROPM1	TIM_CCMR1_OC1MD(8)	// OC1M[3:0] - Retrig OPM mode 1
#define TIM_CCMR1_OC2M_ROPM1	TIM_CCMR1_OC2MD(8)	// OC1M[3:0] - Retrig OPM mode 1
#define TIM_CCMR2_OC3M_ROPM1	TIM_CCMR1_OC1M_ROPM1	// OC1M[3:0] - Retrig OPM mode 1
#define TIM_CCMR2_OC4M_ROPM1	TIM_CCMR1_OC2M_ROPM1	// OC1M[3:0] - Retrig OPM mode 1

#define TIM_CCMR1_OC1M_ROPM2	TIM_CCMR1_OC1MD(9)	// OC1M[3:0] - Retrig OPM mode 2
#define TIM_CCMR1_OC2M_ROPM2	TIM_CCMR1_OC2MD(9)	// OC1M[3:0] - Retrig OPM mode 2
#define TIM_CCMR2_OC3M_ROPM2	TIM_CCMR1_OC1M_ROPM2	// OC1M[3:0] - Retrig OPM mode 1
#define TIM_CCMR2_OC4M_ROPM2	TIM_CCMR1_OC2M_ROPM2	// OC1M[3:0] - Retrig OPM mode 1

#define TIM_CCMR1_OC1M_CPWM1	TIM_CCMR1_OC1MD(12)	// OC1M[3:0] - Combined PWM mode 1 (OR)
#define TIM_CCMR1_OC2M_CPWM1	TIM_CCMR1_OC2MD(12)	// OC1M[3:0] - Combined PWM mode 1 (OR)
#define TIM_CCMR2_OC3M_CPWM1	TIM_CCMR1_OC1M_CPWM1	// OC1M[3:0] - Combined PWM mode 1
#define TIM_CCMR2_OC4M_CPWM1	TIM_CCMR1_OC2M_CPWM1	// OC1M[3:0] - Combined PWM mode 1

#define TIM_CCMR1_OC1M_CPWM2	TIM_CCMR1_OC1MD(13)	// OC1M[3:0] - Combined PWM mode 2 (AND)
#define TIM_CCMR1_OC2M_CPWM2	TIM_CCMR1_OC2MD(13)	// OC1M[3:0] - Combined PWM mode 2 (AND)
#define TIM_CCMR2_OC3M_CPWM2	TIM_CCMR1_OC1M_CPWM2	// OC1M[3:0] - Combined PWM mode 2
#define TIM_CCMR2_OC4M_CPWM2	TIM_CCMR1_OC2M_CPWM2	// OC1M[3:0] - Combined PWM mode 2

#define	TIM_CCMR1_OC12PE	(TIM_CCMR1_OC1PE | TIM_CCMR1_OC2PE)
#define	TIM_CCMR2_OC34PE	(TIM_CCMR2_OC3PE | TIM_CCMR2_OC4PE)
#define	TIM_CCMR_OCPE	(TIM_CCMR1_OC1PE | TIM_CCMR1_OC2PE)	// same for both CCMR

#define SPI_CR1_BRSEL(s) ((s) << 3)
#define SPI_CR1_BRDIV2	SPI_CR1_BRSEL(0)
#define SPI_CR1_BRDIV4	SPI_CR1_BRSEL(1)
#define SPI_CR1_BRDIV8	SPI_CR1_BRSEL(2)
#define SPI_CR1_BRDIV16	SPI_CR1_BRSEL(3)
#define SPI_CR1_BRDIV32	SPI_CR1_BRSEL(4)
#define SPI_CR1_BRDIV64	SPI_CR1_BRSEL(5)

#ifndef	SPI_CR1_DFF
#define SPI_CR2_DSIZE(s) (((s) - 1) << 8)
#endif

// byte access to SPI DR - MUST be __IO (= volatile)!
#define SPI1_DRB	(*(__IO uint8_t *)&SPI1->DR)
#define SPI2_DRB	(*(__IO uint8_t *)&SPI2->DR)
#define SPI2_DRB	(*(__IO uint8_t *)&SPI2->DR)
#define QUADSPI_DRB	(*(__IO uint8_t *)&QUADSPI->DR)

#ifndef FLASH_FKEY1
// defs missing from some device-specific files
#define	FLASH_FKEY1	0x45670123
#define	FLASH_FKEY2	0xCDEF89AB
#endif

#define	EXTI_MR_PVD EXTI_RTSR_TR16

#endif
